["Yahoo News AustraliaMoreSuper Tuesday 2024 – live: Trump gets green light to run for president before biggest day in primary calendar6 days agoOliver O'connell, Joe Sommerlad and Mike BediganBy Oliver O'connell, Joe Sommerlad and Mike Bedigan", "ABC NewsMoreThe 2024 Republican presidential primary could be over in a month15 DecG. Elliott Morris and Elliott MorrisBy G. Elliott Morris and Elliott Morris", "The New York TimesMore2024 Republican Delegate Count, Primary Calendar and Results18 JanMartin Gonzalez Gomez, Albert Sun and Christine ZhangBy Martin Gonzalez Gomez, Albert Sun and Christine Zhang", "CBS NewsMoreTrump wins 2024 New Hampshire primary as Haley vows to continue fight24 JanKaia Hubbard and Melissa QuinnBy Kaia Hubbard and Melissa Quinn", "CNNMoreCNN Poll: Haley trims Trump’s lead to single digits in New Hampshire9 JanAriel Edwards-LevyBy Ariel Edwards-Levy", "CNBCMoreRepublican debate key moments: Haley’s ‘scum’ swipe, Christie’s Warren Buffett shoutout8 Nov 2023Brian Schwartz, Kevin Breuninger and Amanda MaciasBy Brian Schwartz, Kevin Breuninger and Amanda Macias", "The HinduMoreBiden and Trump sweep Super Tuesday primaries; put pressure on Haley to end her campaign6 Mar", "The New York TimesMoreHow Voters Describe the 2024 Election in One Word11 AprCamille BakerBy Camille Baker", "CBS NewsMoreHere's the Republican delegate count for the 2024 primaries so far6 MarMelissa QuinnBy Melissa Quinn", "CBS NewsMoreRNC votes to install Trump's handpicked leaders, tightening his control of party8 Mar", "The New York TimesMoreTrump Leads Biden in Nearly Every Battleground State, New Poll Finds5 Nov 2023Shane GoldmacherBy Shane Goldmacher", "The New York TimesMoreTrump's Win Adds to Air of Inevitability as Haley Sharpens Edge23 JanShane GoldmacherBy Shane Goldmacher", "The New York TimesMoreInside Biden's Anti-Trump Battle Plan (and Where Taylor Swift Fits In)29 JanKatie Rogers, Reid Epstein and Katie GlueckBy Katie Rogers, Reid Epstein and Katie Glueck", "The New York TimesMoreVoters Doubt Biden's Leadership and Favor Trump, Times/Siena Poll Finds2 MarShane GoldmacherBy Shane Goldmacher", "The New York TimesMoreElection Updates: Trump wins in Michigan, Missouri and Idaho as Democrats' concern grows after new poll.6 MarMichael Gold, Neil Vigdor and Jennifer MedinaBy Michael Gold, Neil Vigdor and Jennifer Medina", "The New York TimesMoreTrump Tries to Turn the G.O.P. Race Into a Vice-Presidential Casting Call21 JanMichael Gold and Michael Charles BenderBy Michael Gold and Michael Charles Bender", "The New York TimesMoreSouth Carolina Primary: Trump Defeats Haley, Delivering a Crushing Blow in Her Home State24 FebMichael Gold, Jazmine Ulloa and Maggie AstorBy Michael Gold, Jazmine Ulloa and Maggie Astor", "The New York TimesMoreWill You Vote for Trump Again?11 JanJennifer Medina and Jordan GaleBy Jennifer Medina and Jordan Gale", "The New York TimesMoreGeorgia Republican Presidential Primary Election Results 202412 Mar", "The Associated PressMoreTrump wins New Hampshire primary: Live updates22 Jan", "The New York TimesMoreWhy Trump and the Rest of the G.O.P. Won't Stop Bashing Electric Vehicles5 Oct 2023Jonathan Weisman and Anjali HuynhBy Jonathan Weisman and Anjali Huynh", "CNNMore2024 campaign news: GOP debate and Trump’s final sprint to Iowa caucuses10 JanShania Shelton, Maureen Chowdhury and Tori B. PowellBy Shania Shelton, Maureen Chowdhury and Tori B. Powell", "The New York TimesMoreHow Much Money the 2024 Presidential Candidates Have Raised So Far1 Aug 2023Molly Cook Escobar, Charlie Smart and Rachel ShoreyBy Molly Cook Escobar, Charlie Smart and Rachel Shorey", "CNNMoreTrump wins New Hampshire GOP primary as Haley says she's staying in race24 JanShania Shelton, Jack Forrest and Tori B. PowellBy Shania Shelton, Jack Forrest and Tori B. Powell", "The New York TimesMoreRepublican Presidential Candidates on the Economy and Inflation18 Aug 2023Maggie AstorBy Maggie Astor", "CNN InternationalMoreLive updates: Biden and Trump dominate Super Tuesday as Haley exits race5 MarKaanita Iyer, Shania Shelton and Tori B. PowellBy Kaanita Iyer, Shania Shelton and Tori B. Powell", "ABC NewsMoreWho might Trump pick as his vice president?15 Nov 2023Nathaniel Rakich and Monica PottsBy Nathaniel Rakich and Monica Potts", "The Economic TimesMoreHow Donald Trump went from a diminished ex-president to the GOP's dominant front-runner4 Feb", "The New York TimesMoreTrump Crushing DeSantis and G.O.P. Rivals, Times/Siena Poll Finds31 Jul 2023Shane GoldmacherBy Shane Goldmacher", "The New York TimesMoreKoch Network Raises Over $70 Million for Push to Sink Trump29 Jun 2023Maggie Haberman, Shane Goldmacher and Jonathan SwanBy Maggie Haberman, Shane Goldmacher and Jonathan Swan", "C-SPAN MoreFormer President Trump Campaigns in Derry, New Hampshire23 Oct 2023", "The Economic TimesMoreIt's Haley vs Trump in New Hampshire as Ron DeSantis withdraws from next primary18 Jan", "Al Jazeera EnglishMoreWho is Robert F Kennedy Jr: Election disrupter or change agent?26 MarLorraine MallinderBy Lorraine Mallinder", "CNBCMoreNew Hampshire primary results: Trump wins Republican primary as Haley donors fret over next steps24 JanKevin Breuninger, Ryan Anastasio and Rebecca PicciottoBy Kevin Breuninger, Ryan Anastasio and Rebecca Picciotto", "The Nevada IndependentMoreTrump sweeps Nevada Republican caucus in race with no major challengers8 FebJacob SolisBy Jacob Solis", "The New York TimesMoreWho Could Be Trump’s VP Pick?7 days agoMichael Charles Bender and Rebecca LiebermanBy Michael Charles Bender and Rebecca Lieberman", "The New York TimesMoreChris Christie Announces '24 Run, Taking Square Aim at Trump6 Jun 2023Trip Gabriel and Maggie HabermanBy Trip Gabriel and Maggie Haberman", "CNNMoreThe chance of Trump winning another term is very real30 Jul 2023Harry EntenBy Harry Enten", "C-SPAN MoreFormer President Trump Speaks at California Republican Party Convention2 Oct 2023", "CNNMoreChris Christie skewers Haley and DeSantis on hot mic before ending 2024 campaign10 JanGregory Krieg, Jeff Zeleny and David ChalianBy Gregory Krieg, Jeff Zeleny and David Chalian", "The New York TimesMoreWhich States Vote Today? Plus What Else to Know About Super Tuesday.6 MarMaggie AstorBy Maggie Astor", "The Washington PostMoreOpinion | Would Trump be a dictator? And can he be stopped?30 NovRobert KaganBy Robert Kagan", "BBC.comMoreFact-checking Trump's claims about New York fraud trial2 Oct 2023Nada TawfikBy Nada Tawfik", "CNNMoreTrump’s landslide Iowa win is a stunning show of strength after leaving Washington in disgrace16 JanStephen CollinsonBy Stephen Collinson", "C-SPAN MoreCampaign 2024: Former President Trump Campaigns in Rome, Georgia9 Mar", "The Associated PressMoreRepublican candidates fight each other, and mostly line up behind Trump, at the first debate24 Aug 2023Jill Colvin, Sara Burnett and Jonathan J. CooperBy Jill Colvin, Sara Burnett and Jonathan J. Cooper", "The New York TimesMoreCan Donald Trump clinch the nomination on Super Tuesday?4 MarMaggie AstorBy Maggie Astor", "ReutersMoreWith Trump way ahead in 2024 Republican polls, Iowa becomes do-or-die for DeSantis12 Jul 2023Gram Slattery, Alexandra Ulmer and James OliphantBy Gram Slattery, Alexandra Ulmer and James Oliphant", "The New York TimesMoreWho Are the 2024 Presidential Election Candidates?22 Feb 2023Martin Gonzalez Gomez and Maggie AstorBy Martin Gonzalez Gomez and Maggie Astor", "C-SPAN MoreFormer President Trump Compaigns in Atkinson, New Hampshire16 Jan", "CNNMoreLive updates: The latest on the Iowa caucuses and 2024 primary campaign15 JanJack Forrest, Maureen Chowdhury and Amir VeraBy Jack Forrest, Maureen Chowdhury and Amir Vera", "C-SPAN MoreCampaign 2024: New Hampshire Primary Night Coverage23 Jan", "The New York TimesMoreRon DeSantis Drops Out of 2024 Presidential Race and Endorses Trump21 JanNicholas Nehamas, Maggie Haberman and Jonathan SwanBy Nicholas Nehamas, Maggie Haberman and Jonathan Swan", "CNNMoreAt CPAC, Trump’s potential running mates compete to prove their loyalty24 FebSteve Contorno, Aaron Pellish and Alison MainBy Steve Contorno, Aaron Pellish and Alison Main", "CNNMoreHaley is now the last obstacle to Trump claiming the GOP nomination21 JanStephen CollinsonBy Stephen Collinson", "The New York TimesMoreTrump Likely to Sit Out One or Both of First Two G.O.P. Debates (Published 2023)2 May 2023Maggie Haberman and Jonathan SwanBy Maggie Haberman and Jonathan Swan", "The New York TimesMoreHow College-Educated Republicans Learned to Love Trump Again14 JanMichael Charles BenderBy Michael Charles Bender", "The Associated PressMoreIowa caucus 2024 live updates: Trump wins, DeSantis finishes second15 Jan", "CNNMoreTrump is not invincible in Republican race – but still lacks a single strong challenger21 Sept 2023Stephen CollinsonBy Stephen Collinson", "CoversMore2024 Republican Party Presidential Nominee Odds: Trump a lock8 Nov 2023Rohit PonnaiyaBy Rohit Ponnaiya", "The New York TimesMoreSweeping Raids, Giant Camps and Mass Deportations: Inside Trump's 2025 Immigration Plans11 Nov 2023Charlie Savage, Maggie Haberman and Jonathan SwanBy Charlie Savage, Maggie Haberman and Jonathan Swan", "The New York TimesMoreKoch Network Endorses Nikki Haley in Bid to Push G.O.P. Past Trump28 NovMaggie Haberman, Shane Goldmacher and Jonathan SwanBy Maggie Haberman, Shane Goldmacher and Jonathan Swan", "C-SPAN MoreCampaign 2024: Donald Trump Campaigns in Laconia, New Hampshire22 Jan", "C-SPAN MoreFormer President Trump Holds Rally in Waterford Township, Michigan18 Feb", "Spectrum News NY1MoreDeSantis drops out of 2024 Republican presidential primary, endorses Trump21 JanJoseph KonigBy Joseph Konig", "CNNMoreCan any Republican beat Trump or DeSantis in 2024?5 Feb 2023Harry EntenBy Harry Enten", "FiveThirtyEightMoreWhat Are Trump's Chances Of Winning The GOP Primary?29 Aug 2023G. Elliott MorrisBy G. Elliott Morris", "The New York TimesMoreDoug Burgum, Wealthy North Dakota Governor, Enters Presidential Race7 Jun 2023Nick Corasaniti and Jonathan WeismanBy Nick Corasaniti and Jonathan Weisman", "The Washington PostMoreWhat will happen to America if Trump wins again? Experts helped us game it out.10 Oct 2022", "The TelegraphMoreNew Hampshire primary results: Trump's win as it happened24 JanBenedict Smith and Tim SigsworthBy Benedict Smith and Tim Sigsworth", "The New York TimesMoreMany Americans in Disbelief Over Trump-Biden Election Rematch19 JanReid Epstein and Ken BensingerBy Reid Epstein and Ken Bensinger", "C-SPAN MoreFormer President Trump Rally for House Candidate in Wyoming28 May 2022", "CNNMoreSupreme Court opinion on the Trump 14th Amendment ballot case4 MarDan Berman, Antoinette Radford and Elise HammondBy Dan Berman, Antoinette Radford and Elise Hammond"]